#+TITLE: GnuPG - Monthly donation stats
#+STARTUP: showall
#+SETUPFILE: "../share/setup.inc"

#+HTML: <!--table_data_wideright-->

*** Monthly donations stats since 2017

 | Year | Mon | Total | SEPA | Stripe | Paypal | gSEPA | Fee |
 |------+-----+-------+------+--------+--------+-------+-----|
 | 2017 |  01 |  1771 |  271 |    136 |   1364 |   278 |   7 |
 |      |  02 |   573 |   15 |    371 |    187 |    20 |   5 |
 |      |  03 |   339 |  104 |      5 |    230 |   110 |   6 |
 |      |  04 |  5407 | 4995 |    264 |    148 |  5000 |   5 |
 |      |  05 |   587 |    5 |    509 |     73 |    10 |   5 |
 |      |  06 | 29117 | 5291 |   9887 |  13939 |  5351 |  60 |
 |      |  07 | 14594 | 2356 |   5776 |   6462 |  2410 |  54 |
 |      |  08 |  6905 | 1466 |   2319 |   3120 |  1509 |  43 |
 |      |  09 |  7617 | 1214 |   3105 |   3298 |  1257 |  43 |
 |      |  10 |  6051 | 1182 |   2514 |   2355 |  1227 |  45 |
 |      |  11 |  5426 |  884 |   2405 |   2137 |   920 |  36 |
 |      |  12 | 12003 | 1392 |   3047 |   7564 |  1437 |  45 |
 | 2018 |  01 |  6538 | 1646 |   2422 |   2470 |  1696 |  50 |
 |      |  02 |  4505 |  838 |   1705 |   1962 |   875 |  37 |
 |      |  03 |  7078 | 1058 |   2574 |   3446 |  1101 |  43 |
 |      |  04 |  5230 | 1093 |   1868 |   2269 |  1137 |  44 |
 |      |  05 |  5005 | 1008 |   1778 |   2219 |  1047 |  39 |
 |      |  06 |  7648 | 1897 |   3022 |   2729 |  1943 |  46 |
 |      |  07 |  5450 | 1169 |   2173 |   2108 |  1213 |  44 |
 |      |  08 |  4087 |  767 |   1536 |   1784 |   800 |  33 |
 |      |  09 |  5255 |  966 |   1876 |   2413 |  1003 |  37 |
 |      |  10 |  9151 |  937 |   1622 |   6592 |   976 |  39 |
 |      |  11 |  3846 |  753 |   1418 |   1675 |   785 |  32 |
 |      |  12 |  4938 |  946 |   1928 |   2064 |   986 |  40 |
 | 2019 |  01 |  4788 | 1236 |   1748 |   1804 |  1274 |  38 |
 |      |  02 |  4050 |  483 |   1040 |   2527 |   516 |  33 |
 |      |  03 |  4314 |  696 |   1644 |   1974 |   733 |  37 |
 |      |  04 |  3726 |  715 |   1163 |   1848 |   758 |  43 |
 |      |  05 |  3551 |  888 |   1013 |   1650 |   925 |  37 |
 |      |  06 |  5716 | 1357 |   2357 |   2002 |  1402 |  45 |
 |      |  07 |  4084 |  875 |   1402 |   1807 |   917 |  42 |
 |      |  08 |  3062 |  630 |    866 |   1566 |   663 |  33 |
 |      |  09 |  3518 |  794 |    953 |   1771 |   832 |  38 |
 |      |  10 |  3136 |  690 |    924 |   1522 |   728 |  38 |
 |      |  11 |  2798 |  553 |    728 |   1517 |   584 |  31 |
 |      |  12 |  8817 | 1107 |    957 |   6753 |  1148 |  41 |
 | 2020 |  01 |  2412 |  789 |    864 |   1548 |   825 |  36 |
 |      |  02 |  3563 |  582 |    746 |   2817 |   612 |  30 |
 |      |  03 |  2579 |  722 |   1021 |   1558 |   758 |  36 |
 |      |  04 |  3261 |  599 |    636 |   2625 |   637 |  38 |
 |      |  05 |  1878 |  523 |    637 |   1241 |   557 |  34 |
 |      |  06 |  3150 | 1149 |   1302 |   1848 |  1194 |  45 |
 |      |  07 |  2574 |  722 |    992 |   1582 |   761 |  39 |
 |      |  08 |  1730 |  622 |    553 |   1177 |   657 |  35 |
 |      |  09 |  1567 |  605 |        |   1567 |   642 |  37 |
 |      |  10 |     0 |    0 |        |        |       |     |
 |      |  11 |     0 |    0 |        |        |       |     |
 |      |  12 |     0 |    0 |        |        |       |     |
 #+TBLFM: $3=$4+$5+$6::$4=$7-$8

#+HTML: <div id="smallnote">
Legend: “Total” gives the total net donations in Euro received in that
month.  “SEPA”, “Stripe” and “Paypal” are the net donations from the
respective payment provider.  The “gSEPA” column gives the gross
donations for the SEPA account; the “Fee” column its bank fees.  We do
not record the Stripe payment processing costs.  The detailed Paypal
amounts can be found at this [[file:paypal-summary.org][page]].  One-time and recurring donations
are not distinguished.
#+HTML: </div>
